{
  "posts": [
    {
      "user": "john@gmail.com",
      "id": "ad64",
      "title": "From Zero to Automated Document Workflows: Hands-on with OCTO",
      "body": "The Real Challenge: Intelligent Extraction With Proper Orchestration\nAI extraction has reached a turning point. Models can now reason through document structure and variation with minimal configuration—which means the real opportunity lies in how quickly organizations can deploy that intelligence at scale, inside a secure, controlled environment.\n\nBut here’s the thing: having a capable extraction model is only part of the equation. Solution architects and IT teams know the real challenges come after the demo—fragmented processes, manual exception handling, brittle integrations, and orchestration gaps that demand custom code. These are the reasons many AI pilots stay stuck in proof-of-concept mode.\n\nWe believe the key to moving forward is combining intelligent extraction with proper orchestration. That’s the thinking behind TCG Process’s work with LandingAI.\n\nWhat is Agentic Document Extraction?\nLandingAI’s Agentic Document Extraction (ADE) takes document processing beyond text recognition to true document understanding. Using a human-like, agentic approach, ADE interprets structure, layout, and context together — much as a person would when reading a document — rather than treating content as isolated words or fields.\n\nThis contextual understanding dramatically reduces the need for manual configuration and enables reliable automation across high-volume, highly variable documents. As a result, ADE opens up new use cases that were previously difficult or impractical to automate, including:\n\nParsing highly variable forms, contracts, and insurance applications without pre-defined templates.\nAccurately interpreting identity documents (e.g., passports, driver’s licences) that contain layered security features and diverse spatial layouts.\nExtracting complex tables, charts, and mixed-media elements into structured, context-rich representations.\nConverting decades of archived multimodal documents into searchable, AI-ready data",
      "imgUrl": "https://landing.ai/wp-content/uploads/2026/01/Copy-of-LandingAI-Youtube-Blog-Template.png",
      "category": "Technology",
      "createdAt": 1771049053888,
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "user": "john@gmail.com",
      "id": "1877",
      "title": "Splitting Multi-Document PDFs at Scale with ADE Split",
      "body": "Multi-document PDFs are a major bottleneck in document automation. These files often contain multiple documents or sections within a single PDF, which makes it difficult to apply extraction reliably. As a result, teams are forced to manually review and split PDFs before processing, or they end up running extraction on the wrong pages, applying incorrect schemas, and wasting time and compute on irrelevant content.\n\nADE Split addresses this problem by operating on parsed documents using user-defined Split Rules. Users specify how a file should be separated by defining document types, descriptions, and optional identifiers. Based on these rules, Split identifies document boundaries within a single PDF, groups related pages into well-defined sub-documents, applies document classifications, and preserves page ranges and metadata for full traceability. The original PDF is never modified; instead, Split returns clean, structured JSON that defines exactly how the file is separated.\n\nIn the ADE workflow, Split sits between parsing and extraction. It ensures that extraction runs only on the right pages, with the right schema, and for the right document type. This makes downstream extraction more accurate, more cost-efficient, and easier to scale across large, noisy, real-world document bundles.\n\nIntroduction\nIn many real-world workflows, PDFs do not represent a single, clean document. Financial institutions receive KYC (Know Your Customer) packets that bundle bank statements, utility bills, and identity cards into one file. Healthcare systems ingest patient records that mix intake forms, lab reports, and treatment notes. Legal and accounting teams process packets that contain contracts, invoices, receipts, and supporting exhibits, often scanned and assembled in an inconsistent order.\n\nThese bundled PDFs create a structural problem for document automation. While traditional extraction tools can read text, they treat the file as a flat sequence of pages. They cannot reliably determine where one document ends and another begins, or which pages belong to the same logical unit. As a result, teams either manually review and split files before processing or run extraction across the entire PDF and deal with misapplied schemas, incorrect outputs, and unnecessary downstream rework.\n\nADE Split is designed to address this failure point. It operates on parsed documents using user-defined Split Rules to identify document boundaries, group related pages, and classify each sub-document without modifying the original file. By turning a multi-document PDF into clean, well-defined document groups, Split enables correct routing, extraction, and downstream processing.\n\nIn this post, we’ll look at how Split addresses the structural challenges of multi-document PDFs and prepares them for accurate downstream extraction.\n\nWhat the Split Feature Does\nADE Split operates on parsed documents and returns a structured definition of how a multi-document PDF should be separated. It does not modify the original file. Instead, it produces a machine-readable representation of document groupings that downstream workflows can consume directly.\n\nSplit performs the following core functions:\n\nIdentify document boundaries\n\nSplit uses defined Split Rules to determine where one document ends and another begins. These rules guide how parsed Markdown is analyzed to identify document boundaries, rather than relying on fixed templates or keyword matching.\n\nGroup pages into classified sub-documents\n\nPages that belong together are grouped into sub-documents and assigned a document classification. When multiple instances of the same document type appear in a single file, Split can apply optional identifiers such as invoice numbers, patient names, or dates to separate them correctly.\n\nReturn explicit page ranges and metadata\n\nEach sub-document includes exact page ranges and associated metadata, preserving traceability to the original PDF and enabling deterministic downstream processing.\n\nHandle unmatched content explicitly\n\nPages that do not match any defined document type are marked as  Uncategorized, ensuring all content is accounted for.\n\nWork across inconsistent and scanned inputs\n\nBecause Split operates on parsed structure rather than visual templates, it remains effective across scanned documents, repeated forms, and inconsistent layouts.\n\nWorkflow: From Input File to Extracted Data\nADE processes documents through a three-step workflow: Parse, Split, and Extract. After parsing, users can run Split to separate a document into multiple classified sub-documents. Extraction can then be applied selectively to each split as needed.\n\nStep 1: Parse\nParsing converts an input file into structured Markdown that preserves document layout and content.\n\nThe Parse API analyzes the document visually, identifying text, tables, and structural elements, and grounding them to their locations on the page.\n\nThe Markdown output from Parse is required input for the Split API and serves as the foundation for downstream processing.",
      "imgUrl": "https://landing.ai/wp-content/uploads/2025/12/Splitting-Multi-Document-PDFs-at-Scale-with-ADE-Split-scaled.png",
      "category": "Technology",
      "createdAt": 1771049117213,
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "user": "alice@gmail.com",
      "id": "3edd",
      "title": "How to Automate KYC Document Parsing at Scale with ADE",
      "body": "Introduction\nIn today’s regulated financial world, KYC is essential to building trust and managing risk. Organizations must verify identities, confirm addresses, and review financial documents quickly and accurately — without slowing onboarding.\n\nProcessing KYC documents isn’t a single-document task. It’s a bundle of identity proofs, address proofs, and financial statements that all need to be read, cross-checked, and validated. A typical onboarding flow includes passports, driver’s licenses, utility bills, and bank statements, each with its own layout, language, and noise.\n\nManually reviewing these documents is tedious and time-consuming. Verifying names, photos, and addresses across multiple files slows onboarding and often leads to human error. As the number of applicants grows, this manual process quickly becomes unscalable and inconsistent.\n\nTraditional OCR or template-based systems try to automate the task but often fail under this diversity. They lose layout context, struggle with new formats, and still produce outputs that need manual correction — creating more friction than relief.\n\nThat’s where ADE from LandingAI comes in. Built to handle real-world document complexity, ADE brings a vision-based approach that understands layout, context, and relationships between fields and documents, making KYC automation accurate, consistent, and scalable.\n\nOverview of ADE\nADE, powered by LandingAI’s proprietary DPT models, introduces a new way to understand and extract information from documents. Rather than treating a document as a flat stream of text or relying on rigid templates, ADE interprets it as a visual representation of information — preserving structure, layout, and spatial context that traditional OCR systems often lose.\n\nThe DPT (Document Pre-Trained Transformer) models are trained on large, diverse sets of real-world documents. They enable ADE to recognize not only text but also layout relationships and visual elements such as tables, checkboxes, signatures, barcodes, and even complete ID cards or forms. Each of these components is represented as a structured “chunk,” allowing ADE to parse a document into semantically meaningful sections that align with how humans naturally read it.\n\nIn KYC workflows, this becomes especially powerful. A single KYC packet can contain multiple document types — from an ID card or passport to a utility bill or bank statement — each with different structures and layouts. ADE handles all of them consistently, and you can even extract specific fields like name, address, or expiration date across these documents to cross-check and validate information while maintaining spatial integrity.\n\nThe result is structured, reliable data that reflects the document’s true layout. This visual and contextual understanding makes it possible to automate the complex parsing and cross-verification steps that KYC processes depend on, ensuring both accuracy and traceability at scale.\n\nNext, let’s see ADE in action across KYC documents.\n\nADE in Action\nKYC workflows revolve around two key categories of documents — proof of identity and proof of address. Let’s see how ADE applies the same vision-first logic to both, understanding layout, structure, and relationships between fields, regardless of how complex the document appears.\n\nProof of Identity\nIdentity proofs like passports, national IDs, and driver’s licenses form the foundation of every KYC process. These are structured documents that combine printed text, photos, signatures, and sometimes encoded zones like MRZs or barcodes, all of which must be read accurately to confirm who the customer is.\n\nLet’s take the U.S. Military Identification Card, a compact document that brings together text, seals, a photograph, and a signature box, all within a single layout. For most OCR or rule-based systems, this mix of fonts, overlapping graphics, and stamped patterns can cause misreads.\n\nWhen parsed with ADE, the document is recognized through the card chunk type, which understands the layout as a whole.",
      "imgUrl": "https://landing.ai/wp-content/uploads/2025/12/KYC-Parsing-at-Scale-scaled.png",
      "category": "Technology",
      "createdAt": 1771049281783,
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "user": "alice@gmail.com",
      "id": "fd0b",
      "title": "How a Global Tier-1 Bank Transformed Client Due Diligence ",
      "body": "A global Tier-1 financial institution modernized its Client Due Diligence (CDD) operations within their Know Your Customer (KYC) process by deploying Agentic Document Extraction. Facing rising document volumes, manual review bottlenecks, and increasing regulatory pressure & complexity, the bank introduced AI-driven document intelligence to augment analysts and streamline complex KYC workflows.\n\nThe solution automated extraction across large, non-standard and multi-lingual corporate documents—often hundreds of pages per client—while integrating seamlessly with their existing KYC platform, powered by an RPA software. Running on AWS infrastructure, LandingAI’s agentic approach delivered measurable operational impact without disrupting established processes.\n\nAs a result, the bank achieved a 40–60% reduction in manual document review time, saving hundreds of analyst hours per week across global KYC teams. The bank improved data consistency and auditability, accelerated onboarding and refresh cycles, and strengthened its compliance posture, while scaling KYC capacity without adding headcount.\n\nBy combining LandingAI’s Agentic Document Extraction(ADE) with the scalability, reliability, and security, the bank transformed KYC from a manual bottleneck into a cloud-native, AI-powered capability built to scale with regulatory complexity and business growth.\n\nCustomer Overview\nA global Tier-1 financial institution providing wealth management and wholesale banking services to corporate and ultra high net worth clients across regions, industries, and regulatory regimes. Operating at a massive scale, the bank manages complex onboarding and ongoing compliance processes for some of the world’s largest and most sophisticated organizations and customers.\n\nAt the core of these operations is Know Your Customer (KYC)—a regulatory requirement designed to prevent financial crime, e.g. AML (Anti-Money Laundering), assess risk, and ensure compliance with global standards.\n\nThe Challenge: Manual KYC at Global Scale\nKYC in wholesale banking is fundamentally document-driven. For each corporate client, the bank must collect, review, and validate large volumes of documentation, including:\n\nIncorporation and registration records\nOwnership and beneficial ownership structures\nBoard and directorship information\nAnnual reports and financial statements\nRegulatory and jurisdiction-specific filings\nEach client can submit multiple documents that can reach up to 200–300 pages, and the process often repeats multiple times per year due to regulatory refresh requirements. Additionally, high-risk customers are subject to a more rigorous Enhanced Due Diligence (EDD) process.\n\nHistorically, this work relied on large teams of analysts manually reviewing documents and entering data into downstream systems. The result was a process that was:\n\nSlow and expensive to operate\nDifficult to scale during volume spikes\nProne to inconsistency and human error\nIncreasingly risky in a tightening regulatory environment\nAt the same time, high-profile enforcement actions across the banking industry reinforced the cost of ineffective KYC—both financially and reputationally. The bank recognized that traditional automation approaches were no longer sufficient.\n\nIncreasing Demand on Client Due Diligence Modernization\nTo address these challenges, the bank launched a Client Due Diligence (CDD) modernization initiative. The objective was not to replace analysts or rip out existing systems, but to fundamentally improve how documents are processed and how information flows through the KYC lifecycle.\n\nKey goals included:\n\nReducing time spent on manual document review\nImproving data accuracy, and consistency with full auditability & traceability\nIntegrating AI into existing KYC platforms and workflows\nBuilding a flexible and scalable, cloud-native architecture that could evolve over time\nThis initiative created the opportunity to introduce AI-driven document intelligence as a core capability.\n\nWhy LandingAI\nThe bank evaluated several document automation solutions, but many fell short of enterprise requirements. Some required extensive training data and fine-tuning, which was impractical for sensitive financial documents. Others relied on rigid templates that failed on non-standard or visually complex files.\n\nLandingAI stood out for its ability to extract structured information from highly complex documents without requiring templating or any training. Its Agentic Document Extraction (ADE) platform combines:\n\nLayout-aware parsing\nVisual grounding across text, tables, and diagrams\nAgent-based reasoning to correlate entities across documents\nEqually important, LandingAI aligned with the bank’s strategy to deploy on their Virtual Private Cloud infrastructure, meeting strict security, scalability, and compliance requirements.\n\n“Accuracy and auditability are non-negotiable in KYC. LandingAI helped us standardize extraction across regions and teams, strengthening our compliance posture while reducing manual effort and fitting cleanly into our existing workflows.”\n\n— Senior Leader, Financial Crime & Compliance Platform\n\nThe Solution: Agentic Document Extraction \nLandingAI partnered with the bank to deploy an AI-powered document intelligence solution built on AWS.\n\nThe solution begins with intelligent ingestion and indexing of KYC documents within the bank’s AWS environment. LandingAI ADE uses layout-aware parsing and visual grounding to understand document structure, extracting text, tables, diagrams, and visual elements.\n\nUsing LandingAI’s proprietary foundation models running on AWS GPUs, ADE performs agentic extraction. This enables the system to reason across documents and identify relationships such as corporate hierarchies, beneficial owners, directors, and shareholders.\n\nExtracted data is securely staged within AWS compute services and integrated into downstream KYC platforms and workflows. Analysts remain in the loop, reviewing and validating outputs, but their role shifts from manual document reading to higher-value analysis and decision-making.\n\nThe result is a cloud-native, scalable document intelligence layer that augments existing KYC systems without disrupting them.",
      "imgUrl": "https://landing.ai/wp-content/uploads/2026/02/Thumbnail-06-copy.jpg-1.jpeg",
      "category": "Technology",
      "createdAt": 1771049489069,
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "fa2f",
      "title": "Announcing LandingAI Builder Program",
      "body": "Today, we are pleased to announce the LandingAI Builder Program. Having been a founder myself, we have designed the program to help developers and start-ups to build quickly using Agentic Document Extraction. \n\nOur builders get access to our Development Center, which includes a rich set of tools, integrations, templates, early access to features, priority rate limits, and dedicated support, so you can confidently build your idea or start-up. \n\nWe will keep expanding the Development Center and builder resources. For example, we are adding a new Integrations section with pre-built code to seamlessly connect to other AI tools, such as Chroma, an easy-to-use vector DB that you can run locally or as a server.\n\nIf you are interested, please apply here. Come build with us. \n\nTony Li, VP of Partnerships\n\nSpotlights on Builders\nOur earliest builders are already transforming workflows with ADE—launching products, integrating into enterprise systems, and pioneering agentic AI adoption. Here’s what they’re saying:\n\n“At TCG Process, we help enterprises automate complex processes with accuracy and trust. We continuously evaluate emerging technologies to ensure our customers can seamlessly integrate the latest best-of-breed solutions into their operations, and we are proud to partner with Landing AI in this mission. Their Agentic Document Extraction (ADE) has proven to be both accurate and easy to use. Now, as one of the first partners in Landing AI’s new Builder Program, we are building on that foundation to deliver reliable, transparent, and scalable automation that our customers can validate and trust.”     – Neil Walker, Head of Product, TCG Process\n\n“LandingAI’s Builder Program aligns perfectly with phData’s mission to help enterprises build reliable, production-grade AI. With ADE, developers and data teams gain structured, governed access to document intelligence—whether it’s parsing financial filings, extracting healthcare data, or streamlining legal reviews. We’re excited to bring this capability to customers and co-create new solutions.”   – Dominick Rocco, VP of AI and Machine Learning, PhData\n\nThese early collaborations are just the beginning. The insights, feedback, and creativity from our first builders are shaping the next wave of agentic capabilities in ADE—helping us make it even easier to extract, validate, and act on information from unstructured documents. \n\nThe Builder Community in Action\n\nInnovation happens when builders connect. These photos capture recent moments where developers, product leaders, and innovators gathered virtually and in person to build smarter AI systems with Agentic Document Extraction.\n\nMore events coming soon—join the builder community shaping the future of agentic AI.",
      "imgUrl": "https://landing.ai/wp-content/uploads/2025/10/Announcing-LandingAI-Builder-Program.jpg",
      "category": "Coding",
      "createdAt": 1771053611170,
      "user": "john@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "4983",
      "title": "Creamy Dairy-Free Thai Curry Coconut Soup",
      "body": "Creamy, dairy-free Thai curry coconut soup is the velvety smooth, non-dairy cream soup of your dreams! Whenever the weather starts to turn cooler, we reach for a bowl of this fragrant, warming, and comforting vegan soup with potatoes, peas, broccoli, Thai green curry paste, and coconut cream.\n\nRecipe yieldServes 4Total time 30 minutes\nIngredients\n2 large heads of broccoli\n1 cup peas\n1 onion\n1 large potato\n1⁄2 cup coconut cream\n3 cloves garlic\nHandful of fresh parsley, chopped\nHandful of fresh dill, chopped\n1 tbsp olive oil\n1-2 tsp Thai green curry paste, to taste\nCurry powder, salt and pepper, to taste\n1.5 liters of water (or 50 fl. oz.)\nInstructions\nFinely chop the potato, broccoli, onion, and garlic.\nCombine all the ingredients in a saucepan over medium heat.\nAfter about 20 minutes, when the vegetables are tender, remove from the heat.\nFor a smooth soup, blend with a hand blender until smooth.\nGarnish with fresh herbs, croutons, and/or sesame seeds, and enjoy hot.",
      "imgUrl": "https://challenge22.b-cdn.net/wp-content/uploads/2025/09/thai-curry-coconut-soup-with-broccoli.jpg.1050x750.webp?v=3",
      "category": "Cooking",
      "createdAt": 1771156384572,
      "user": "john@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "e387",
      "title": "Ginger Cookies Crispy on the outside, soft on the inside,",
      "body": "Crispy on the outside, soft on the inside, these cookies will fill your house with the warm aromas of ginger, cinnamon, nutmeg, and orange zest. These delicious cookies are perfect to enjoy with a hot drink, or even to make as a gift for a loved one.\n\nInspired by the ginger cookie recipe by Loving It Vegan\n\nTotal time 30 minutes\nIngredients\n¼ cup vegan butter or unsalted margarine\n1 cup brown sugar\n¼ cup agave syrup, or maple syrup\n½ tsp vanilla extract\n2 cups flour (We like to use half wholemeal flour for extra chewiness and extra nutrients)\n1 tsp baking soda\n¼ tsp salt\n2 tsp ground ginger\n2 tsp ground cinnamon\n¼ tsp ground nutmeg\n1 tsp orange zest\n2-3 tbsp plant milk\nInstructions\nPreheat the oven to 180°C (350°F) and line a baking sheet with parchment paper.\nCream together the vegan butter and brown sugar until light and fluffy. Add your sweetener and vanilla, and mix well.\nIn a separate bowl, combine the dry ingredients: flour, baking soda, salt, ginger, cinnamon, nutmeg, and orange zest.\nGradually add the dry ingredients to the wet ingredients and mix well.\nAdd 2 tablespoons of plant-based milk and mix until a firm dough forms that holds together but is not too wet. If it’s still too dry, add another tablespoon of plant milk.\nRoll the dough into about 20 walnut-sized balls.\nPlace the balls on your baking sheet, leaving space between each one, and flatten them slightly with a spoon.\nBake for 12 minutes for soft cookies or 14–15 minutes for very crispy ones.\nLet them cool on the baking sheet for a few minutes before moving them. They will get firmer as they cool.",
      "imgUrl": "https://challenge22.b-cdn.net/wp-content/uploads/2026/01/ginger-biscuits1.jpg.1050x750.webp?v=3",
      "category": "Cooking",
      "createdAt": 1771156732970,
      "user": "john@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "795e",
      "title": "Vegan Palak 'Paneer' Tofu with vegan naan bread",
      "body": "We’ve been waiting for this one for a while! This classic vegetarian Indian dish is finally getting a vegan upgrade! Super firm tofu and perfectly spiced spinach curry are a match made in heaven. Serve with aromatic rice, vegan paratha or fluffy vegan naan bread, or all of the above!\n\nIngredients\n250g spinach (or 8.8 oz.)\n1 tbsp fresh ginger\n6 garlic cloves\n100g super firm tofu, cubed (or 3.5 oz.)\n½ tsp cumin seeds\n1 red onion\n1 tomato, chopped\n1 tbsp oil\n¼ tsp chili powder\nA pinch of turmeric\n½ tsp salt\n¼ tsp curry powder\n½ tsp garam masala\n2-4 tbsp coconut cream, or 2 tbsp other vegan cream\nInstructions\nBoil the spinach for 10 minutes, drain and allow to cool slightly.\nIn a food processor, blend the spinach with a quarter cup of water. Set aside.\nBlend the ginger and garlic with 1½ tablespoons of water until you get a smooth puree. Set aside.\nSauté the cubed tofu in a little oil until golden brown and set aside.\nIn a large frying pan, heat 1½ tbsp oil and lightly sauté the cumin seeds. Add the onion and sauté until golden brown.\nAdd the garlic and ginger paste, and the rest of the spices.\nAfter a few minutes, add the chopped tomato and ¼ cup of water. Cook on medium heat for 5 minutes, mixing and crushing the tomato.\nAdd the spinach and ¼ cup of water to the pan.\nAt this point you can also add your coconut cream or other vegan cream, for a creamier, slightly more decadent result.\nCook for another 5 minutes.\nAdd the tofu and salt to the pan and heat your curry for another 3 minutes.",
      "imgUrl": "https://challenge22.b-cdn.net/wp-content/uploads/2025/08/vegan-palak-paneer.jpg.1050x750.webp?v=3",
      "category": "Cooking",
      "createdAt": 1771156821610,
      "user": "john@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "3eeb",
      "title": "Lemon Coconut Soda the lemon also provides vitamin C and antioxidants",
      "body": "Ingredients\n1 cup coconut cream\n1 cup cold water, or sparkling water\n⅓ cup fresh lemon juice\n3 tbsp coconut sugar, agave, or sweetener to taste\n1 cup ice cubes\nZest of ½ lemon (optional, for added flavor)\nLemon slices and mint leaves for garnish (optional)\nInstructions\nIn a blender, add the coconut milk, water, lemon juice, sweetener, and ice.\nBlend for 1 minute or until well combined and slightly frothy.\nTaste and adjust the sweetness if you like.\nServe in glasses with more ice and garnish with lemon wedges and mint, if desired. Enjoy!",
      "imgUrl": "https://challenge22.b-cdn.net/wp-content/uploads/2025/10/limonada.jpeg.1050x750.webp?v=3",
      "category": "Cooking",
      "createdAt": 1771156889174,
      "user": "alice@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "171a",
      "title": "Best Action Cameras for 2026: Top Features, Uses",
      "body": "In the realm of adventure and exploration, capturing every moment in its raw intensity has become indispensable. This is where an action camera transcends the traditional boundaries of photography and videography with its compact size, robust build, and waterproof capabilities. For example, an action camera for motovlogging can do things that a normal camera can’t.\n\nFor travel influencers, particularly those into adventure travel and sports, action cameras are more useful than a phone camera or a DSLR.\n\nDesigned to accompany adrenaline enthusiasts on their quests, these devices ensure that no leap, dive, or sprint goes undocumented. The importance of an action camera in preserving the essence of adventure cannot be overstated, making it a vital tool for anyone looking to immortalise their exploits.\n\nThe article provides a detailed examination of how these cameras can enhance the adventure experience, offering a roadmap for enthusiasts aiming to make informed decisions about incorporating an action camera into their gear collection.\n\nBest Action Cameras In India On The Basis Of Key Features\nAction cameras are characterised by their unique features that set them apart from traditional cameras:\n\n1. Compact and Lightweight Design\nAction cameras are small and lightweight, making them easy to carry, mount, and use without feeling weighed down. Their compact design allows them to be attached to various surfaces or worn on the body, providing users with a unique and hands-free perspective. This feature is especially useful for motovlogging, as you can mount the camera on your helmet or motorcycle to capture every twist and turn.\n\nThe most compact and lightweight action camera available in India right now is Insta 360 Go series. Key Features:\n\nAbout the size of a finger\nPerfect hands-free experience\nUnique accessories such as the Magnet Pendant and Easy Clip that no other action camera provides\nClick Here To Buy the Recommended Insta 360 Go Series Camera\n\n2. Rugged and Waterproof Build\nOne of the most important features of an action camera is its durability. These cameras are built to withstand extreme conditions, including shocks, dust, and water. Many action cameras are waterproof to depths of up to several meters, making them perfect for underwater photography and water-based activities like surfing or snorkeling. Whether you’re hiking through rain or diving into the ocean, your action camera can handle it all.\n\nIf you had asked me the most rugged action camera ever existed a few years ago, I would have named the Gopro. Now, however, I would suggest the DJI Osmo Action. Key features:\n\nBetter sensor for stunning low-light and night-photography\nBetter battery backup\nStonger hardware which makes it more sturdy.\nClick here to buy the Recommended version of Osmo Action",
      "imgUrl": "https://footloosedev.com/wp-content/uploads/best-motovlogging-camera-1024x491.jpg",
      "category": "Travelling",
      "createdAt": 1771157223213,
      "user": "john@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "3726",
      "title": "Why Are We Always So Uninterested To See Our Own Country?",
      "body": "Their names have escaped me now but I vividly remember that interesting and equally memorable conversation I had with a young Indian couple from the Fort Kochi, in South India. I was waiting for my appointment with an immigration officer in Thimpu — to extend my tourist permit while backpacking in Bhutan when all of a sudden this distinguishably affable couple appeared in front of me.\n\nOur conversation started with one of those moments when you meet another traveller from your home country and you find yourself forced to exchange the usual banalities of how amazing this place is, followed by the ubiquitous gamut of ‘Where are you from in India’ and ‘where you’re going next’.\n\nAs we finished the small talk, I asked them about their favourite places in south India. I had a long desire to travel south of India. South India was their home, after all, I thought no one could know the answer better but it turned out they were some of those people for whom travelling in your own country was not worth it.\n\nAs I asked the question, I could sense a moment of panic among them, struggling to find the right answer. “Can’t say, haven’t seen much in India, you know,” said the girl. Later I found out that they have travelled to more than 50 countries across the world, including most of South America and Africa.\n\nI’ve never understood the alluring fascination with travelling abroad. Or why travelling to your own country is so underrated.\n\nWhy do people want to pay a crock of gold when they can see something equally beautiful in their own country?\n\nThis statement particularly applies to those living in countries like India. India is so big and diverse that one needs a lifetime to understand its myriad and heterogeneous settings.\n\nI mean you do a Delhi to Bangalore road trip and you can see it all: hills, desert, coast, cities, villages… you name it.\n\nIf I ever go looking for my heart’s desire again, I won’t look any further than my own backyard. Because if it isn’t there, I never really lost it to begin with” Dorothy, The Wizard of Oz\n\nDoes travelling abroad have to do with getting new stamps on our passport, or with the pretentious charm behind it? I mean it feels great to check-in on Facebook from the Indira Gandhi International Airport Terminal 3, but paying heaps of money for a road trip in Germany when you can experience something similar in the mountains in India sounds like a shoddy deal to me.\n\nWhen I was in Northeast India – bumping into a familiar north Indian face became a rarity. I bet you go to London and you’ll find more Indians than you can ever find in entire northeast India altogether. This is when travelling in your own country comes with all the benefits.",
      "imgUrl": "https://footloosedev.com/wp-content/uploads/Travel-job-1024x609.jpg",
      "category": "Travelling",
      "createdAt": 1771157306362,
      "user": "john@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "cacc",
      "title": "A day trip to Chittorgarh from Udaipur",
      "body": "Are you visiting Udaipur in Rajasthan? Plan a one day trip to Chittorgarh Fort, when deciding on an itinerary. The Chittorgarh Fort is the biggest fort in India, with magnificent architecture and vibrant and exciting history, of valiant kings, battles and sieges, and tales of romance and Jauhar.\n\n\nI was in Udaipur, for a friend's son's wedding, where I met up with a bunch of old friends. We extended our stay by a few days, and spent the time, exploring places of interest around this beautiful city. It was the time when the movie Padmavat was in the news, hogging primetime debates on national television, and eliciting quite a controversy. Curiosity got the better of us, and we couldn't resist the urge to visit Chittorgarh, the famed site where history was created.\n\nWe set off early, seated comfortably in a Tempo Traveller, booked the previous evening. Chittorgarh is roughly 115 km from Udaipur, and it takes just over 2 ½ hours to reach. It's a comfortable stretch on well-laid National Highways. I mention this, because it's good enough for a road trip, on a bike or car. Public transport, between the two cities, is good too.\n\n\n\nThe driver's assistant (Kuldip) acted as our unofficial tour guide. Kuldip qualified for the part, born and brought up, as he was, in those parts. He had many a tale of romance and bravery to share. Of course, none could be authenticated, but his constant jabber kept us engaged and piqued our interest.\n\n\nChittorgarh History\n\nChittorgarh has a rich history, and it gives you a sense of being on 'hallowed' ground, where many a mighty warrior once roamed. There is a lot to see and do, in this place, that was once the capital of Mewar. Every structure standing here bears testimony to its great heritage. The imposing fort and the striking temples, the spectacular palaces and the monumental towers, all have a story to tell. They stand testimony of honour, valour, passion, loyalty and sacrifice of a bygone era.\n\nThe history of Chittorgarh is captivating, stories of battles and bloody siege. Tales of heroism, fortitude and romance, stories of death and destruction. Legends of queens and aristocratic women sacrificing their lives in Jauhar. These fascinating stories have the power of captivating an eager audience. And over the years these tales have been immortalised into ballads and folk songs.\n\nA tour of the Chittorgarh Fort\n\nOnce you're there, you can't stop being in awe of the place. I got goosebumps, as I stood admiring the sheer size and grandeur of the fort. It is a magnificent structure, standing atop a 180-metre-high hill, spreading across roughly 692 acres, offering panoramic views of the surrounding countryside. It has the distinction of being the largest fort in the country. That must tell you something about its size and grandiose.\n\nThe Chittorgarh Fort is one of the eight sites, in Rajasthan, declared as UNESCO World Heritage Sites. There is no concrete evidence on who built it, but historians estimate that it was raised in the 7th century, during the reign of the Mauryan Empire.\n\nThe splendour of the fort is not limited to its size and dimensions. It is also recognised for its unique and well-perceived architecture. There are 84 artificially made reservoirs around the fort, and they are a pure genius — their presence illustrates the well-thought-of construction, in medieval times. The water bodies were so designed that they could hold sufficient water to meet the water requirements for a fleet of 50,000 soldiers for four years running.\n\nSeven gates lead to the fort; the main entrance is called Ram Pol. The gates were designed intelligently to prevent the enemy from entering or attacking the fort. What you see today are the ruins, but they paint such a compelling picture of a glorious past. Not everything is run and torn down; we were told around 65 monuments still stand, mainly palaces, temples, towers and cenotaphs. The victory towers are the most striking structures.\n\nMyths of Chittorgarh\n\nKuldip regaled us with many anecdotes; some seemed farfetched, but legends are part of the belief of people. One titbit that he shared with us was that the Bhim (one of the Pandava) built the fort, in one night. Another fascinating story was on how Bhimlat Kund, one of the 84 reservoirs got its name. Myth has it that Bhim became thirsty, and there was no water on the hilltop. So, he struck the ground and water appeared in that spot.\n\n\n\nLegend of Rani Padmini or Padmavati\n\nAccording to legend, Padmavati was a strikingly beautiful princess, married to Raja Ratan Singh, the ruler of Mewar. Her gorgeous good looks resulted in her being the central character for numerous ballads and narratives. She is the subject of several folktales originating in the region. The most famous piece on her is credited to Sufi poet, Malik Muhammad Jayasi. His poem romanticised the legendary queen, giving her a mystical aura.\n\nThe ballad, titled Padmavat, reads like a fairytale, centring around talking parrots extolling the beauty of the queen and the drama that unfolded, involving Ratan Singh and Allaudin Khiji and ending with Padmavat committing Jauhar. What parts are facts and which fiction is not known.\n\nStories of Akbar's siege on Chittorgarh\n\nAnother bit of 'history' shared by Kuldip was that of Akbar. According to the story, Rana Uday Singh's son joined hands with the Mughal emperor, only to learn that he was planning on conquering Chittorgarh. The son returned to appraise Rana Uday Singh, but from then on, the narrative turned sketchy. Some versions spoke of the Rana winning, others of him escaping…\n\nHowever, the Vijay Stambh within the fort is evidence of a battle having been won. Whether the Rana defeated Akbar's army or Khilji's troupes remained unclear.\n\nThe story of Mira Bai\n\nI had heard of Mira Bai but was unaware that she had lived in Chittorgarh. The spiritual poet was married to Bhoj Raj Singh, the crown prince of Mewar. She is among the most illustrious Bhakti Saints, and a temple in her honour stands within the fort.\n\nIf you are in Chittorgarh for a day, like we were, I recommend visiting the following places, within the fort.\n\nPalaces in Chittorgarh\n\nThe ruins of the Rana Kumbha Palace are hauntingly beautiful. What a majestic palace it would have been. The panoramic view of the city, from here is quite amazing, especially with the sun setting in the background.",
      "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Chittorgarh_fort.JPG",
      "category": "Travelling",
      "createdAt": 1771157381256,
      "user": "alice@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "4f6f",
      "title": "How To Click Amazing Holiday Photographs",
      "body": "Hello friends are you planning to go on a trip or on a vacation? Do you want to know how to make it a memorable one by clicking some amazing pictures? Read out this complete article on how to click the amazing photographs no matter what camera you are using. After research of many photographs of my friends I have tried my best to shot out best pictures in this article.\n\n\n\nPhotography\n\nBefore going on a holiday planning is must. A perfect planning will make your trip Perfect\nThe thing that you are going to ponder over after the holidays is your photographs. It is the proof that you can show to all your loved ones that you went on the holiday. Its rightly said that photographs of happy moments would give you eternal happiness than the material things. So definitely you shouln't miss out the best part of your holidays.\nDon't you think if the photos are the best part of the trip then they should be really amazing? To make sure that you don't miss out best of best photographs here are some great poses you can try on a holiday. They will make your photos best.\nShare them on social networking sites I bet everyone would be amazed by seeing different kind of poses.\n\nSingles Poses\n\nZoom your face",
      "imgUrl": "https://www.indiatravelblog.com/attachments/Resources/9854-1-Parshad-vyas.JPG",
      "category": "Travelling",
      "createdAt": 1771157457637,
      "user": "alice@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "d860",
      "title": "Reviving a Dead Pet Project Back in 2017 ",
      "body": "Back in 2017 I started working on a pet project. A browser game implementation of a rather complex traditional German card game called “Doppelkopf”. I’m sure one of the smart kids in the comments sections I see everywhere could’ve built this thing in a weekend — I couldn’t. Not even close.\n\nI didn’t have huge goals for the browser game back then. I had started playing Doppelkopf with friends in Hamburg regularly and noticed that my game just wasn’t up to snuff. Being a smart-ass software developer myself I knew that the obvious solution to any problem was to build software. In my case that’s software that can play Doppelkopf. If I could build this, I thought, my own understanding of the intricacies of the game would improve, and maybe some people out there get a kick out of playing this game while I was at it.\n\nI’m not as smart as those folks in the comments sections. This endeavor did not take a weekend. Even a handful of weekends didn’t cut it. I worked on it in teeny-tiny chunks, whenever I had a few minutes to spare and ended up building something somewhat usable over the course of years. I wrote about it back in 2017, published my source code on GitHub, got some pretty cool open source contributions (thanks folks 🫶) and ended up with something that implemented about 70% of the entire game’s gnarly ruleset.\n\nThen I ran out of steam.\n\nKey features remained unimplemented. Despite my best intentions to solve those one day, I just couldn’t get myself to continue. The code base was in a decent enough shape, mind you. It’s obviously far from perfect but test coverage was pretty good since I TDD’ed the entire thing, which is what allowed me to have such a long run to begin with. The problem was that I hadn’t anticipated the last remaining features in my initial designs and implementing them would’ve required a substantial overhaul of the code’s design. I couldn’t get myself to spend any spare brain cycles thinking about how I’d pull that off. My work as a software developer (or engineering manager these days) makes me think about software and systems all day, 40+ hours each week. While this pet project started as a creative outlet that allowed me to explore new technology just for shits and giggles, eventually that become more and more of a chore. I was trucking along because I wanted to complete what I started, not because I enjoyed the process any longer. It felt like just another job, without anyone paying me to do it.\n\nSometime around 2022, after months of merely picking low-hanging fruit, I ended up leaving the project in its half-finished state and walked away from it. Not over night but rather as a slow and creeping process.\n\nSomewhere deep down, the thought that I didn’t manage to finish this damn thing haunted me whenever I thought about it. Without the game being complete, nobody would really get much of a thrill out of playing it. While building this project I got a much bigger appreciation for what this project could be: Besides getting a stronger grasp for the intricacies of Doppelkopf, I sensed that — if done right — this browser game could really help a lot of people out there to get started with this wonderful card game and inspire them to socialize and start playing in real-life.\n\nWhat initially started as an attempt at salvaging my old code base, upgrading a few dependencies, ironing out some quirks and doing overdue refactorings ended up in me throwing away everything and starting all over from scratch. Oh the beauty of a pet project, where you can commit cardinal sins without anyone giving you a hard time for it!\n\nRewriting the browser game was harder than I anticipated. My coding chops had gotten a little creaky after years of mostly working with squishy human problems most of my days. More importantly though, I spent the first three weeks trying to outsmart myself. “If I’m going to rewrite it, I’m going to do everything differently this time”, I told myself. Learning from the past mistakes that lead me to get stuck was a good idea. When rebuilding this thing I designed the new system with all the overhauls in mind that were difficult to retrofit into the old code base.\n\nUltimately I took the desire to do differently too far which and I ended up running in circles. Where I had a readable, useful and testable object-oriented domain model for the game’s core in my first code base, I wanted to take a more functional approach this time out of a silly desire to write more idiomatic TypeScript. Using classes doesn’t feel idiomatic in TypeScript, so pure functions and immutable data structures were my declared ideal. Implementing immutable data structures turned out to be a hassle that wasn’t worth it and doesn’t align with svelte’s reactivity system. Pure functions ended up being more convoluted than my previous object-oriented domain model that encapsulated state and behavior nicely. After a lot of trial-and-error I ended up where I started, with a good old object-oriented domain model utilizing JavaScript’s class syntax with a couple of functional patterns sprinkled on top where they help — turns out OO lends itself nicely to game development, who’d have guessed.\n\nOnce I’d found my stride, things started flowing nicely. I churned out a lot of features in a short time, obsessed over UI details and accessibility concerns, and ended up rebuilding the entire game from scratch but this time including the missing 30% of functionality. It was a blissful time and I ended up losing track of my days numerous times — time flies when you’re having fun.\n\nI considered experimenting with AI-assisted coding to combat my current skepticism but decided against it. I was just having too much fun honing my own skills, sweating the details and being in a flow state and didn’t want AI-tooling to take the fun out of it, reducing my job to prompting and reviewing outputs. My progress might have been faster, who knows. Yet I’m certain I wouldn’t have lasted as long as things would’ve stopped being fun early on.\n\nI contemplated a lot whether I wanted to build the new version as an open source project like my first attempt. As much as I believe in the positive things open source can bring, I decided against it. One thing I learned when building the first version is that collaborating with open source contributors who share your passion can feel refreshing, validating, energizing. Paradoxically at the same time it was probably the one thing that suffocated my own passion more than anything else. Suddenly you’re reviewing other people’s code, explaining your ideas so others can follow, discussing with people online. Suddenly your pet project feels more like… actual work. Now I could make the source code available and simply not accept contributions. But then I’m cautious of what happens with my code in this day and age (and it’s depressing that that’s how I think about it). With the large scale intellectual theft we’re seeing from current large language models, with repeated patterns of people and organizations trying to profit off of hard work other people put into their projects without ever giving anything back, I just don’t feel like I want to publish my work for others to make a profit. I don’t know if this project will ever turn a profit (secretly I don’t want it to — that’s once more where creativity stops and tedium starts), but if it does I want to be the one profiting from my own hard labor and creativity.\n\nGood things take time. After years, this project is finally in a state where I’m feeling a sense of completion and accomplishment. Work, private life, and everything in between can make it hard to dedicate time to a thing you were once passionate about, and I’m glad to see that this passion ultimately came back with a vengeance. Creativity ebbs and flows, and creativity needs idle time and boredom to flourish. I was fortunate to have a couple of weeks of idle time and boredom and I’m stoked that I managed to use it to rekindle my passion. When creative endeavors start to feel too much like a chore, I think it’s better for the end result to step away until passion comes back. I just hope that next time it doesn’t take years.\n\nI’ve got high hopes for this project and think it can become more meaningful than my initial, selfish attempt at becoming a better Doppelkopf player. It can be the home for thousands of people trying to pick up this delightful (yet notoriously hard to learn) card game — and I hope that I can give something back by publishing my project like that.",
      "imgUrl": "https://hamvocke.com/_astro/newspaper.DH3y4aN-_Z1X1TC0.webp",
      "category": "Coding",
      "createdAt": 1771157644906,
      "user": "john@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "918f",
      "title": "How to Create a CSS-only Elastic Text Effect",
      "body": "Cool, right? We have a realistic elastic effect with nothing but CSS. It’s also flexible and easy to adjust. Before we dig into the code, let me start with an important warning. It’s a nice effect but it comes with several drawbacks.\n\nImportant Disclaimer About Accessibility\nThe effect we are making relies on splitting words into letters, which, in general, is a very bad idea.\n\nA simple link with a word in it is normally like this:\n\n\n<a href=\"#\">About</a>\n  \nBut we need to target and style individual letters, so we’ll be doing this:\n\n\n<a href=\"#\">\n  <span>A</span><span>b</span><span>o</span><span>u</span><span>t</span>\n</a>\n  \nThis has accessibility drawbacks.\n\nThere is a strong temptation to use aria-* attributes to fix that up. Or that’s what I thought, anyway. I found a few online resources that recommend using a structure similar to this one:\n\n\n<a href=\"#\" aria-label=\"About\">\n  <span aria-hidden=\"true\">\n    <span>A</span><span>b</span><span>o</span><span>u</span><span>t</span>\n  </span>\n</a>\n  \nLooks good, right? No! That structure is still terrible. Actually, most of the structures you will find online are bad. I am not an expert in the field, so I asked around, and two blog posts by Adrian Roselli emerged:\n\nBarriers from Links with ARIA\nYou Know What? Just Don’t Split Words into Letters\nI highly recommend you read them to understand why splitting words is a bad idea (and what the potential solutions might be).\n\nSo why am I making this demo anyway?\n\nI consider it more of a CSS experiment to explore modern features. That effect probably contains many properties that you are not aware of so it’s a good opportunity to discover them. Use it for fun or within a side project, but think twice before including it anywhere in widespread use or mission critical.\n\nNow that you are warned, let’s get started.\n\nHow Does It Work?\nThe idea is to use the offset() property and define a path that the letters should follow. That path will be a curve that we animate along. The offset() property is an underrated feature, but it has a lot of potential, especially when combined with modern features. I used it to create an infinite marquee animation, to perfectly position elements around a circle, to create a fancy gallery of images, and so on.\n\nHere is a simplified example to understand the trick we will be using:",
      "imgUrl": "https://i0.wp.com/frontendmasters.com/blog/wp-content/uploads/2026/02/wiggle.jpg?resize=1024%2C614&ssl=1",
      "category": "Coding",
      "createdAt": 1771157803977,
      "user": "john@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "6e52",
      "title": "Background Patterns with CSS `corner-radius`",
      "body": "The corner-shape property in CSS can do some neat designs. Things like vintage tickets, with corners trimmed inwards, sci-fi corners, tags, and those types of designs are usually comes to mind when we think of the CSS property corner-shape.\n\nThere are a variety of nice primitive keywords we get with corner-shape, like round (the default), bevel, scoop, squircle, and the all-powerful superellipse(). It’s actually quite easy to create interesting shapes that can be used for more than corner decorations.\n\nThink patterned backgrounds.The corner-shape property in CSS can do some neat designs. Things like vintage tickets, with corners trimmed inwards, sci-fi corners, tags, and those types of designs are usually comes to mind when we think of the CSS property corner-shape.\n\nThere are a variety of nice primitive keywords we get with corner-shape, like round (the default), bevel, scoop, squircle, and the all-powerful superellipse(). It’s actually quite easy to create interesting shapes that can be used for more than corner decorations.\n\nThink patterned backgrounds.\n\nThe corner-shape Property\nWhile border-radius determines the size of the corner, corner-shape specifies its form. Both are needed to get the style. Just as border-radius, corner-shape affects the borders and shadows of an element.\n\nIt is a shorthand for corner-top-left-shape, corner-top-right-shape, corner-bottom-left-shape, and corner-bottom-right-shape.\n\nEmbedding into a Background\nHere’s the trick!\n\nWe can make HTML elements into a background by embedding it through SVG as a data URL. Like this:\n\n\n.element-with-the-background {\n  background: url('data:image/svg+xml,<svg xmlns=\"http://www.w3.org\"><foreignObject width=\"100%\" height=\"100%\"><div xmlns=\"http://www.w3.org/1999/xhtml\">Styled HTML</div></foreignObject></svg>'\n}\n CSS \nThe unwrapped SVG part of the URL:\n\n\n<svg xmlns=\"http://www.w3.org\">\n  <foreignObject width=\"100%\" height=\"100%\">\n    <div xmlns=\"http://www.w3.org/1999/xhtml\">Styled HTML</div>\n  </foreignObject>\n</svg>\n  \nThe trick is to style an element into a desired shape using corner-shape and add that markup to a background’s data URL.\n\nThe Shapes\nSay we want to make a pattern based on a <div> that has these styles on it:\n\n\nbackground: red;\nwidth: 30px;\naspect-ratio: 1;\nborder-radius: 30%;\ncorner-shape: superellipse(-3);\n CSS \nTo reduce code length in the URL, we’ll put all those styles as inline styles right onto the <div> we’re going to embed into the SVG:\n\n\n<div style='background:red;width:30px;height:30px;corner-shape:superellipse(-3);border-radius:30%;'></div>\n  \nAll corners get the superellipse(-3) style (similar to the scoop design) that are sized by the given border radius of 30%.\n\nNow to use this styled div within SVG, which we can then use in CSS for a background, we’ll put it in a background: url() function with a Data URL and repeat it with standard CSS properties.",
      "imgUrl": "https://i0.wp.com/frontendmasters.com/blog/wp-content/uploads/2026/02/pattern-thumb.jpg?resize=1024%2C614&ssl=1",
      "category": "Coding",
      "createdAt": 1771157883938,
      "user": "alice@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "6d50",
      "title": "The Browser Hates Surprises We often treat the browser like a canva",
      "body": "We often treat the browser like a canvas — a blank slate waiting for us to paint pixels. But this mental model is flawed. The browser isn’t really a painter; it’s a constraint solver.\n\nEvery time you load a page, you enter a high-speed negotiation. You provide the rules (HTML & CSS), and the browser calculates the geometry. When you give it all the math upfront, the result feels magical: a stable, buttery-smooth experience.\n\nBut when we force the browser to recalculate that geometry mid-stream — because an image loaded late, a scrollbar popped in, or a font swapped — we break the spell.\n\nWe know this phenomenon as “Cumulative Layout Shift” (CLS), but really, it’s just jank. And jank doesn’t happen by accident. It happens because we surprised the browser.\n\nTo fix this, we need to stop fighting the rendering engine and start orchestrating it. But first, seeing is believing. Let’s look at exactly what it looks like when we get it wrong.\n\nA “Hostile” Web Site\nI call what we’re doing in the demo below “hostile” because the code is indifferent to the browser’s needs. It treats the rendering engine like a bucket we can dump data into whenever it arrives.\n\nIn the code below, you will see four distinct “surprises” that break the user experience:\n\nThe Sticky Header Collision: When you click “Jump to Section 2,” the browser scrolls correctly to the top of the element, but the title gets buried behind the fixed header.\nPopcorn Loading: The text and images load independently. The layout jumps once for the text, and again for the image.\nThe Image Shift: The image isn’t reserved space. It pushes the text down when it finally arrives.\nThe Scrollbar Shift: When the content grows long enough, a physical scrollbar pops in (on Windows/Linux), shifting the entire UI to the left.\n\n\nInstead of firing three separate state updates (three separate reflows), we wait for the entire “scene” to be ready. We trade a few milliseconds of “First Paint” for a UI that arrives fully formed.\n\n\n// Don't just fetch. Orchestrate.\nasync function loadScene() {\n  // Wait for critical actors to be ready\n  const results = await Promise.all([\n    fetch('/api/text'),\n    fetch('/api/image')\n  ]);\n\n  // Update the state ONCE. \n  // One reflow. One paint.\n  setFullScene(results);\n}\n JavaScript \nPhase 4: The “Stable” Application\nHere is the exact same application, but negotiated correctly.\n\nNotice how “calm” the loading feels. The layout never jumps. The scroll lands exactly where you expect. It feels like a native application because we gave the browser the constraints it needed before painting.\n\n",
      "imgUrl": "https://i0.wp.com/frontendmasters.com/blog/wp-content/uploads/2026/02/party.jpg?resize=1024%2C619&ssl=1",
      "category": "Coding",
      "createdAt": 1771158155582,
      "user": "john@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "1af9",
      "title": "Scientist Discovered Why Most Traders Lose Money Surprising Statistics",
      "body": "80% of all day traders quit within the first two years. 1\nAmong all day traders, nearly 40% day trade for only one month. Within three years, only 13% continue to day trade. After five years, only 7% remain. 1\nTraders sell winners at a 50% higher rate than losers. 60% of sales are winners, while 40% of sales are losers.2\nThe average individual investor underperforms a market index by 1.5% per year. Active traders underperform by 6.5% annually. 3\nDay traders with strong past performance go on to earn strong returns in the future. Though only about 1% of all day traders are able to predictably profit net of fees. 1\nTraders with up to a 10 years negative track record continue to trade. This suggests that day traders even continue to trade when they receive a negative signal regarding their ability. 1\nProfitable day traders make up a small proportion of all traders – 1.6% in the average year. However, these day traders are very active – accounting for 12% of all day trading activity. 1\nAmong all traders, profitable traders increase their trading more than unprofitable day traders. 1\nPoor individuals tend to spend a greater proportion of their income on lottery purchases and their demand for lottery increases with a decline in their income. 4\nInvestors with a large differential between their existing economic conditions and their aspiration levels hold riskier stocks in their portfolios. 4\nMen trade more than women. And unmarried men trade more than married men. 5\nPoor, young men, who live in urban areas and belong to specific minority groups invest more in stocks with lottery-type features. 5\nWithin each income group, gamblers underperform non-gamblers. 4\nInvestors tend to sell winning investments while holding on to their losing investments. 6\nTrading in Taiwan dropped by about 25% when a lottery was introduced in April 2002. 7\nDuring periods with unusually large lottery jackpot, individual investor trading declines. 8\nInvestors are more likely to repurchase a stock that they previously sold for a profit than one previously sold for a loss. 9\nAn increase in search frequency [in a specific instrument] predicts higher returns in the following two weeks. 10\nIndividual investors trade more actively when their most recent trades were successful.11\nTraders don’t learn about trading. “Trading to learn” is no more rational or profitable than playing roulette to learn for the individual investor.1\nThe average day trader loses money by a considerable margin after adjusting for transaction costs.\n[In Taiwan] the losses of individual investors are about 2% of GDP.\nInvestors overweight stocks in the industry in which they are employed.\nTraders with a high-IQ tend to hold more mutual funds and larger number of stocks. Therefore, benefit more from diversification effects.\n \n\nConclusion: Why Most Traders Lose Money Is Not Surprising Anymore\nAfter going over these 24 statistics it’s very obvious to tell why traders fail. More often than not trading decisions are not based on sound research, tested trading methods or their trading journal, but on emotions, the need for entertainment and the hope to make a fortune in no time.\n\nWhat traders always forget is that trading is a profession and requires skills that need to be developed over the years. Therefore, be mindful of your trading decisions and the view you have on trading. Don’t expect to be a millionaire by the end of the year, but keep in mind the possibilities trading online has. \n\nWe, at Tradeciety, built the Edgewonk trading journal which is a trading tool that allows traders to track and analyze their trades to improve their trading performance. A trading journal is a great way to become a professional trader and start taking trading seriously. \n\n \n\n————\n\n– 1Barber, Lee, Odean (2010): Do Day Traders Rationally Learn About Their Ability?\n– 2Odean (1998): Volume, volatility, price, and profit when all traders are above average\n– 3Barber, & Odean (2000): Trading is hazardous to your wealth: The common stock investment performance of individual investors\n– 4 Kumar: Who Gambles In The Stock Market?\n– 5 Barber, Odean (2001): Boys will be boys: Gender, overconfidence, and common stock investment\n– 6Calvet, L. E., Campbell, J., & Sodini P. (2009). Fight or flight? Portfolio rebalancing by individual investors.\n–7Barber, B. M., Lee, Y., Liu, Y., & Odean, T. (2009). Just how much do individual investors lose by trading?\n– 8Gao, X., & Lin, T. (2011). Do individual investors trade stocks as gambling? Evidence from repeated natural experiments\n– 9Strahilevitz, M., Odean, T., & Barber, B. (2011). Once burned, twice shy: How naïve learning, counterfactuals, and regret affect the repurchase of stocks previously sol.\n– 10Da, Z., Engelberg, J., & Gao, P. (2011). In search of attention\n– 11De, S., Gondhi, N. R. & Pochiraju, B. (2010). Does sign matter more than size? An investigation into the source of investor overconfidence",
      "imgUrl": "https://tradeciety.com/hubfs/Why%20traders%20fail%20statistics.png",
      "category": "Trading",
      "createdAt": 1771158693364,
      "user": "alice@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "4e16",
      "title": "6 Secret Tips For Supply And Demand Trading",
      "body": "Spotting supply and demand zones on your charts can be a helpful trading tool. Similar to support and resistance levels, these zones highlight areas on the chart where the price is likely to bounce or reverse.\n\nTraders use these zones to pinpoint areas where they might buy or sell. In other words, supply and demand zones act as a first filter, helping you identify potentially profitable price levels.\n\n \n\nSupport and Resistance vs Supply and Demand\nAlthough the concept of supply and demand is somewhat similar to support and resistance, there are some important differences between the two concepts. Whereas support and resistance levels simply exist at price turning points, supply and demand zones are found at the origin of strong momentum and trend movements.\n\nThe image below shows conventional support and resistance zones, marking price turning points. Many traders struggle using support and resistance because the price often reacts quickly at those levels without providing easy entry points.\n\nThe 6 tips for supply and demand trading\nWhereas drawing support and resistance levels is straightforward, finding good supply and demand zones is often not as simple. For that reason, this article explains the 6 odds enhancers that enable traders to distinguish between good and bad supply and demand zones in their trading. \n\n \n\n1) Moderate volatility\nA good demand zone typically shows narrow price behavior before the explosive breakout. If the zone shows a lot of candle wicks and strong back and forth during the zone, it doesn't qualify as a high-probability zone. \n\nThe narrower a supply/demand zone before a strong breakout is, the better the chances for a good reaction the next time typically. ",
      "imgUrl": "https://tradeciety.com/hubfs/Supply%20Demand%20Intro.gif",
      "category": "Trading",
      "createdAt": 1771158777851,
      "user": "john@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    },
    {
      "id": "60d5",
      "title": "Best Trading Journals of 2026: Which One Should You Choose?",
      "body": "Choosing the right trading journal is essential for traders wanting to analyze performance, refine strategies, and improve consistency. In this article, we compare popular trading journals—Edgewonk, Tradersync, Tradervue, TradesViz, and TradeZella—breaking down their features, pricing, and unique offerings. Explore which journal best fits your needs and trading style.\n\n \n\nWhat is a trading journal\nA trading journal is a powerful tool that helps traders track, analyze, and improve their trading performance. By recording each trade's details, a journal provides valuable insights into trading habits and decision-making patterns. Beyond just numbers, a good trading journal includes features to analyze trading psychology, manage risk, and identify strengths and weaknesses. It enables traders to refine their strategies and stay disciplined over time. Whether you're a beginner or an experienced trader, a trading journal is essential for continuous growth and achieving consistency in the markets.\n\n \n\nEdgewonk (Our tip)\nEdgewonk is a trading journal that sets itself apart by focusing solely on what traders truly need in a journaling tool. Its comprehensive suite of features includes automated trade imports, detailed journaling options, and powerful trading psychology analytics—all designed to help traders analyze performance and refine their strategies without distractions.\n\nWith an affordable price and no hidden costs, Edgewonk delivers exceptional value, prioritizing core journaling functions over unnecessary extras. While it does not include backtesting, or trade replay functionalities, this focused approach ensures a streamlined experience tailored to improving trading habits and performance. For those seeking a dedicated and effective trading journal, Edgewonk is an unbeatable choice.\n\nDeveloped by the founders of Tradeciety.com, Edgewonk is a trading journal designed by traders, for traders.\n\nHomepage: Edgewonk.com\n\n \n\nPros\n\nAutomated trade imports\nComprehensive journaling features\nAffordable price\nTrading psychology analytics\n \n\nCons\n\nNo backtesting (you should get a dedicated backtesting software for backtesting anyway)\nOptions support limited\nNo monthly plan (but 14-day refund period)\n\nTradersync\nTradersync is a trading journal that provides a wide range of reporting features, with notable support for options trading and a modern user interface. Though Tradersync comes at a significantly higher cost compared to other journals offering identical reporting features.\n\nOne of its key offerings is the combination of backtesting capabilities with journaling. While backtesting can be valuable for traders, it is generally more effective when done through specialized platforms designed specifically for that purpose. This integration can make Tradersync feel overly complex and less focused on the primary goal of a trading journal: analyzing past trades and improving performance.\n\nFor traders seeking a pure and effective journaling experience, Tradersync's approach may feel unnecessarily bloated and less tailored to core journaling needs.\n\n\nPros\n\nExtensive options trading support\nBacktesting\n7 day trial\nCons\n\nExpensive\nNo strategy testing\nImportant features cost extra",
      "imgUrl": "https://tradeciety.com/hubfs/Best%20Trading%20Journal%202026.png",
      "category": "Trading",
      "createdAt": 1771158880400,
      "user": "alice@gmail.com",
      "comments": [
        {
          "id": "c1",
          "name": "John Carter",
          "commentText": "AI is transforming industries rapidly!",
          "createdAt": "2026-02-10T10:15:00.000Z"
        },
        {
          "id": "c2",
          "name": "Sophia Lee",
          "commentText": "Great insights about machine learning trends.",
          "createdAt": "2026-02-11T12:30:00.000Z"
        }
      ]
    }
  ]
}
